#client = 'Петя'
#print(client)
#print(' и ')
#pet = "кот"
#print(pet)


#r = 'Red'
#g = 'Green'
#b =  'Blue'
#print(b, g, r+g+b, b, g + b,)


#Что нужно сделать
# Создайте две переменные с именами «Первое животное» и «Второе животное» на английском языке. 
# Запишите в первую переменную слово «Заяц», а во вторую — «Черепаха». 
# Используя эти переменные, выведите на экран текст «Заяц спит, Черепаха идёт» в одну строку


#firstanimal ="bunny"
#secondanimal ="turtle"

#print(firstanimal, "sleep",",", secondanimal ,"walking"  ".")



#firstname = input("enter user name:")
#hello = "доброе утро,"
#print(firstname,hello)
#intro = "к сожалению, у вас нет доступа к системе."
#info = "Пожалуйста, обратитесь к системному администратору."
#print(intro,"\n",info)


# Что нужно сделать
# Напишите программу для сервиса заказа билетов,
# которая запрашивает у пользователя город вылета и город прилёта. 
# Затем выведите их в одну строку через тире. 
# Обратите внимание на свои переменные: названия должны отражать содержимое.


fly = input("введите город вылета:")
arrival = input("введите город прилета:")
print (fly,"-" ,arrival)

pep = "pepka osujdaet"

if fly == "baku":
    print("примерное время полета 6 часов")
    
elif fly == "moskva":
    print("примерное время полета 20 часов" )
else:
    print(pep)




